---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GeometryFailures.SuccessToConvertLine
source: html/1a92dabe-8532-07af-377d-f894ce9993bd.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GeometryFailures.SuccessToConvertLine Property

Success to convert lines

## Syntax (C#)
```csharp
public static FailureDefinitionId SuccessToConvertLine { get; }
```